## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_subnet.subnet has been deleted
  - resource "azurerm_subnet" "subnet" {
        id                                             = "/subscriptions/8645e34f-3344-494c-acd6-d6785e830b27/resourceGroups/bhun0002-bhup0006-a12-rg/providers/Microsoft.Network/virtualNetworks/my-vnet/subnets/my-subnet"
      - name                                           = "my-subnet" -> null
        # (9 unchanged attributes hidden)
    }

  # azurerm_virtual_network.vnet has been deleted
  - resource "azurerm_virtual_network" "vnet" {
        id                      = "/subscriptions/8645e34f-3344-494c-acd6-d6785e830b27/resourceGroups/bhun0002-bhup0006-a12-rg/providers/Microsoft.Network/virtualNetworks/my-vnet"
      - name                    = "my-vnet" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "bhup0006-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "bhun0002-bhup0006-a12-rg"
      + virtual_network_name                           = "bhup0006-bhun0002"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "bhup0006-bhun0002"
      + resource_group_name = "bhun0002-bhup0006-a12-rg"
      + subnet              = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ subnet_name          = "my-subnet" -> "bhup0006-subnet"
  ~ virtual_network_name = "my-vnet" -> "bhup0006-bhun0002"
```
</details>